In [18]:
import numpy as np
import pandas as pd

In [2]:
print(np)
print(np.__version__)
print(pd)
print(pd.__version__)

<module 'numpy' from 'C:\\Users\\User\\anaconda3\\lib\\site-packages\\numpy\\__init__.py'>
1.19.2
<module 'pandas' from 'C:\\Users\\User\\anaconda3\\lib\\site-packages\\pandas\\__init__.py'>
1.1.3

In [8]:
df = pd.DataFrame({
    'Apples': [30],
    'Bananas': [21],
})
print(df)
df

   Apples  Bananas
0      30       21

   Apples  Bananas
0      30       21

In [9]:
df = pd.DataFrame([[30,21], [41,34]], index=['2017 Sales', '2018 Sales'], columns=['Apples', 'Bananas'])
print(df)
df

            Apples  Bananas
2017 Sales      30       21
2018 Sales      41       34

            Apples  Bananas
2017 Sales      30       21
2018 Sales      41       34

In [41]:
df = pd.DataFrame([['Austin',139,'Sun'], ['Dallas',237,'Sun'], ['Austin',139,'Mon'], ['Dallas',456,'Mon']], columns=['city', 'visitor', 'weekday'])
print(df)
df

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      139     Mon
3  Dallas      456     Mon

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      139     Mon
3  Dallas      456     Mon

In [42]:
S=np.nanmean(df['visitor'][df['weekday']=='Sun'])
print('Sun', S)
M=np.nanmean(df['visitor'][df['weekday']=='Mon'])
print('Mon', M)

Sun 188.0
Mon 297.5